---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialThickness
source: html/a9971533-bb60-157c-97fc-66b04b8c27d7.htm
---
# Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialThickness Property

The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.

## Syntax (C#)
```csharp
public double DoubleWallMaterialThickness { get; }
```